"""
Напишите программу для решения задачи умножения натуральных двузначных чисел
"""

a = int(input())
b = input()

a = int(a[1:])
print(b * a)
