"""
Напишите программу для решения задачи
"""

send = int(input())
more = str(input())

money = int(more[1:])

print(send, more, send+money, sep='\n')
